Tekla Open API Reference for Tekla Structures 2025
Projection.LineToPlane Method
 Returns a new line which is a projection of the given line onto the given plane.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Line LineToPlane(
	Line Line,
	GeometricPlane Plane
)
Public Shared Function LineToPlane (
	Line As Line,
	Plane As GeometricPlane
) As Line
Parameters
Line
Type: Tekla.Structures.Geometry3d.Line
The line to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Line
The new projection line.
See Also
Reference
Projection Class
Tekla.Structures.Geometry3d Namespace